public/regular-expressions.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Regular Expressions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" >
</head>
<body>
<div id="content" class="content">
<h1 class="title">Regular Expressions</h1>
<nav class="breadcrumbs">
<a href="/index.html">index</a> <span class="separator">/</span> <span>.</span>
</nav>
<div class="nav-buttons">
<a href="/simple-text-processing.html" class="nav-button"><< Simple Text Processing</a>
<a href="/sed.html" class="nav-button">>> sed</a>
</div>
<div id="table-of-contents" role="doc-toc">
<div class="toc-header" onclick="toggleToc()">
<h2>Table of Contents</h2>
<div class="toggle-icon">+</div>
</div>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5c5692d">BREs</a>
<ul>
<li><a href="#org866d00f">Regular expression concepts</a>
<ul>
<li><a href="#orgfc68c40"><code>grep</code> options</a></li>
<li><a href="#org2373c1b">Robustness</a></li>
</ul>
</li>
<li><a href="#org9235838">Basic regex components</a>
<ul>
<li><a href="#org8f8de89">single char expressions</a></li>
<li><a href="#org783170d">bracket expressions</a></li>
<li><a href="#org4d23ede">repetition - zero or more</a></li>
<li><a href="#org6f773a3">repetition - interval expressions</a></li>
<li><a href="#org4bccec2">achoring maches</a></li>
<li><a href="#orge26c8bd">parenthasized subexpressions</a></li>
<li><a href="#org99aacbf">operator precedence</a></li>
<li><a href="#org9e216f1">longest, leftmost match</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6d9ac12">EREs</a>
<ul>
<li><a href="#orgb466715">Regular expression concepts</a>
<ul>
<li><a href="#org97ea81b"><code>grep</code> options</a></li>
<li><a href="#org49195c0">Robustness</a></li>
</ul>
</li>
<li><a href="#org2d3ade5">Basic regex components</a></li>
<li><a href="#org6ec036a">Aditional repetition operators</a></li>
<li><a href="#orgdbeee58">Grouping with parenthesis</a></li>
<li><a href="#org2850789">Alternation</a></li>
<li><a href="#org571ae13">ERE operator precedence</a></li>
<li><a href="#org8c8335d">Robustness</a></li>
<li><a href="#orgfa1e954">Using plain grep</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5c5692d" class="outline-2">
<h2 id="org5c5692d">BREs</h2>
<div class="outline-text-2" id="text-org5c5692d">
</div>
<div id="outline-container-org866d00f" class="outline-3">
<h3 id="org866d00f">Regular expression concepts</h3>
<div class="outline-text-3" id="text-org866d00f">
<p>
A regex is a language describing text to be matched
</p>

<p>
A regex is composed of:
</p>
<ul class="org-ul">
<li><b>regular chars</b> that stand for themselves</li>
<li><b>metachars</b> that stand for a regular expression</li>
<li><b>expressions</b> denoting categories of chars or sub-parts of a regex</li>
</ul>

<p>
Historically, different tools used different regex "flavors"
</p>

<p>
POSIX standardizes 2 flavours.
Other tools enhances regexs beyond what we cover here
</p>

<ul class="org-ul">
<li><b>Basic Regucal Expression (BRE)</b>
<ul class="org-ul">
<li>simpler to learn, less computationally expensive</li>
</ul></li>
<li><b>Extended Regucal Expression (*ERE)</b>
<ul class="org-ul">
<li>much more powerful, more expensive</li>
<li>on moern systems, no real difference in "expense"</li>
</ul></li>
</ul>

<p>
What programs use regex?
</p>
<ul class="org-ul">
<li>The <code>grep</code> family
<ul class="org-ul">
<li><code>grep</code> - BRE</li>
<li><code>egrep</code> and <code>grep -E</code> - ERE</li>
<li><code>fgrep</code> and <code>grep -F</code> - string matching in parallel</li>
<li>POSIX standardizing brings them all into the single <code>grep</code> command</li>
</ul></li>
<li><code>sed</code> - text matching and substitution</li>
<li><code>awk</code> - pattern matching with programming</li>
<li>text editors: <code>ed</code>, <code>ex</code>, <code>vim</code>, <code>emacs</code></li>
<li>scripting languages, usually with their on flavours</li>
</ul>
</div>
<div id="outline-container-orgfc68c40" class="outline-4">
<h4 id="orgfc68c40"><code>grep</code> options</h4>
<div class="outline-text-4" id="text-orgfc68c40">
<ul class="org-ul">
<li>use <code>pat</code> as pattern: <code>-e pat</code></li>
<li>read list of patterns from file: <code>-f file</code></li>
<li>ignore case in input: <code>-i</code></li>
<li>list matching input files: <code>-l</code></li>
<li>print lines that don't match: <code>-v</code></li>
<li>supress output ("quiet", exit status only): <code>-q</code>
<ul class="org-ul">
<li>often, you can use <code>&gt; /dev/null</code> instead (more obvious)</li>
</ul></li>
<li>don't print errors ("silent"): <code>-s</code></li>
</ul>
</div>
</div>
<div id="outline-container-org2373c1b" class="outline-4">
<h4 id="org2373c1b">Robustness</h4>
<div class="outline-text-4" id="text-org2373c1b">
<ul class="org-ul">
<li>invest time in learning regexs</li>
<li>use EREs wherever possible</li>
<li><b>always quote your regexs on the shell command line</b></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9235838" class="outline-3">
<h3 id="org9235838">Basic regex components</h3>
<div class="outline-text-3" id="text-org9235838">
</div>
<div id="outline-container-org8f8de89" class="outline-4">
<h4 id="org8f8de89">single char expressions</h4>
<div class="outline-text-4" id="text-org8f8de89">
<ul class="org-ul">
<li>reg chars, like "A" or "#" match themselves</li>
<li>case matters: "A" and "a" are different</li>
<li>period ("dot") matches any single char
<ul class="org-ul">
<li>may or may not match newline, program dependent</li>
</ul></li>
<li>escaped metachar:
<ul class="org-ul">
<li><code>\.</code> matches a real period</li>
<li><code>\\</code> matches a real backslash</li>
</ul></li>

<li>reg chars match themselves:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">echo 'Hi there how are you' | grep --color=always 'how'
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'Hi there how are you'</span> | grep -o <span style="font-style: italic;">'how'</span>
</pre>
</div>

<pre class="example">
how
</pre>


<ul class="org-ul">
<li>dot matches any single char:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> tolstoy says im toldtoy | grep -o tol.toy
</pre>
</div>

<pre class="example">
tolstoy
toldtoy
</pre>
</div>
</div>
<div id="outline-container-org783170d" class="outline-4">
<h4 id="org783170d">bracket expressions</h4>
<div class="outline-text-4" id="text-org783170d">
<ul class="org-ul">
<li>any one of a set: <code>[aeiouy]</code> matches <i>one</i> Englis vowel</li>
<li>any not in a set: <code>[^aieouy]</code> matches a non-vowel</li>
<li>ranges: <code>[0-9]</code> -&gt; a digit, <code>[a-z]</code> -&gt; a lowercase letter
<ul class="org-ul">
<li>locale dependent (messy)</li>
</ul></li>
<li>characted classes: digits, punctuation, letters, &#x2026;
<ul class="org-ul">
<li>classes: alnum, alpha, blank, cntrl, digit, graph, lower, print, punct, space, upper, digit</li>
</ul></li>

<li><code>grep</code> matches all ocurrences</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | grep -o <span style="font-style: italic;">'[aeiouy]'</span>
</pre>
</div>

<pre class="example">
e
a
</pre>


<p>
Using <code>sed</code> to substitute, matches only the first:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | sed <span style="font-style: italic;">'s/[aeiouy]/X/'</span>
</pre>
</div>

<pre class="example">
123 Xafg
</pre>


<p>
Complemented bracket expressions &amp; char classes:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg | grep -o <span style="font-style: italic;">'[^aeiouy]'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"---"</span>
<span style="font-weight: bold;">echo</span> 123 eafg | grep -o <span style="font-style: italic;">'[[:digit:]]'</span>
</pre>
</div>

<pre class="example" id="org4ea5874">
1
2
3

f
g
---
1
2
3
</pre>
</div>
</div>
<div id="outline-container-org4d23ede" class="outline-4">
<h4 id="org4d23ede">repetition - zero or more</h4>
<div class="outline-text-4" id="text-org4d23ede">
<p>
Asterisk ("star") indicates zero or more of the preceding char
</p>

<ul class="org-ul">
<li><code>ab*c</code> matches <code>ac</code>, <code>abc</code>, <code>abbc</code>,  <code>abbbc</code>, &#x2026;</li>
<li>zero of "x" does not mean one or more of "y"</li>
<li><code>.*</code> matches any single char, 0 or more times (careful, <b>also matches null string</b>)</li>
</ul>
</div>
</div>
<div id="outline-container-org6f773a3" class="outline-4">
<h4 id="org6f773a3">repetition - interval expressions</h4>
<div class="outline-text-4" id="text-org6f773a3">
<ul class="org-ul">
<li><code>c\{N\}</code> - <i>N</i> occurrences of <i>c</i></li>
<li><code>c\{N,\}</code> - at least <i>N</i> occurrences of <i>c</i></li>
<li><code>c\{N, M\}</code> - <i>N</i> to <i>M</i> occurrences of <i>c</i> (<i>N</i>, <i>M</i> up to <code>RE_DUP_MAX</code>)</li>
</ul>

<p>
Here <i>c</i> means a single char as described earlier
</p>
</div>
</div>
<div id="outline-container-org4bccec2" class="outline-4">
<h4 id="org4bccec2">achoring maches</h4>
<div class="outline-text-4" id="text-org4bccec2">
<ul class="org-ul">
<li>cared ("up arrow", "hat", <code>^</code>) - match must start at beginning of line or string</li>
<li>dollar sign (<code>$</code>) - match must occur at end of line or string</li>
<li><code>^</code> and <code>$</code> in the middle of a BRE stand for themselves</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 you 123 | grep -o <span style="font-style: italic;">'^[[:digit:]]*'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"---"</span>
<span style="font-weight: bold;">echo</span> 123 you 123 | grep -o <span style="font-style: italic;">'^[^[:digit:]]*'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"---"</span>
<span style="font-weight: bold;">echo</span> 123 you 123 | grep -o <span style="font-style: italic;">'[^[:digit:]]*$'</span>
</pre>
</div>

<pre class="example">
123
---
---
</pre>
</div>
</div>
<div id="outline-container-orge26c8bd" class="outline-4">
<h4 id="orge26c8bd">parenthasized subexpressions</h4>
<div class="outline-text-4" id="text-orge26c8bd">
<ul class="org-ul">
<li><code>\(a[bc\)\(123\)xx\2\1</code> - same as <code>a[bc]123xxM2M1</code>
<ul class="org-ul">
<li><i>M1</i> and <i>M2</i> are the actual text that matched the expressions in the parentheses</li>
<li>contents of parentheses can be any regex!</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> pre ab123xx123xab post | grep -o <span style="font-style: italic;">'\(a[bc]\)\([0-9][0-9]*\)xx\2x\1'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'---'</span>
<span style="font-weight: bold;">echo</span> pre ab123xx321xac post | grep -o <span style="font-style: italic;">'\(a[bc]\)\([0-9][0-9]*\)xx\2x\1'</span>
</pre>
</div>

<pre class="example">
ab123xx123xab
---
</pre>


<ul class="org-ul">
<li>up to 9 parenthesized subexpres are allowed</li>

<li>often termed "backreferences"</li>

<li><b>BREs only</b></li>
</ul>
</div>
</div>
<div id="outline-container-org99aacbf" class="outline-4">
<h4 id="org99aacbf">operator precedence</h4>
<div class="outline-text-4" id="text-org99aacbf">
<p>
From heighest to lowest:
</p>
<ol class="org-ol">
<li>bracket symbols: <code>[:class:]</code>, <code>[=c=]</code>, <code>[.cs.]</code></li>
<li><code>\metachar</code></li>
<li>bracket expressions</li>
<li><code>\(...\)</code> and <code>\digit</code></li>
<li><code>*</code> and <code>\{...\}</code></li>
<li>concatenation (<code>abc</code> is a followed by <code>b</code> followed by <code>c</code>)</li>
<li><code>^</code> and <code>$</code> anchors</li>
</ol>
</div>
</div>
<div id="outline-container-org9e216f1" class="outline-4">
<h4 id="org9e216f1">longest, leftmost match</h4>
<div class="outline-text-4" id="text-org9e216f1">
<ul class="org-ul">
<li>regexs match the longest possible, leftmost ocurrence of text that can match</li>
<li>the match ends at the first character that cannot be matched</li>
<li>if some text matched, that text is used, even if a longer match occurs later on the line</li>
<li>this matters when doing substitutions (replacing matched text with <code>sed</code>, <code>awk</code>, &#x2026;)</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> 123 eafg 123 youyou | sed <span style="font-style: italic;">'s/[aeiouy]*/X/'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">g for matching ALL
</span><span style="font-weight: bold;">echo</span> 123 eafg 123 youyou | sed <span style="font-style: italic;">'s/[aeiouy][aeiouy]*/X/g'</span>
</pre>
</div>

<pre class="example">
X123 eafg 123 youyou
123 Xfg 123 X
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6d9ac12" class="outline-2">
<h2 id="org6d9ac12">EREs</h2>
<div class="outline-text-2" id="text-org6d9ac12">
</div>
<div id="outline-container-orgb466715" class="outline-3">
<h3 id="orgb466715">Regular expression concepts</h3>
<div class="outline-text-3" id="text-orgb466715">
<p>
A regex is a language describing text to be matched
</p>

<p>
A regex is composed of:
</p>
<ul class="org-ul">
<li><b>regular chars</b> that stand for themselves</li>
<li><b>metachars</b> that stand for a regular expression</li>
<li><b>expressions</b> denoting categories of chars or sub-parts of a regex</li>
</ul>

<p>
Historically, different tools used different regex "flavors"
</p>

<p>
POSIX standardizes 2 flavours.
Other tools enhances regexs beyond what we cover here
</p>

<ul class="org-ul">
<li><b>Basic Regucal Expression (BRE)</b>
<ul class="org-ul">
<li>simpler to learn, less computationally expensive</li>
</ul></li>
<li><b>Extended Regucal Expression (*ERE)</b>
<ul class="org-ul">
<li>much more powerful, more expensive</li>
<li>on moern systems, no real difference in "expense"</li>
</ul></li>
</ul>

<p>
What programs use regex?
</p>
<ul class="org-ul">
<li>The <code>grep</code> family
<ul class="org-ul">
<li><code>grep</code> - BRE</li>
<li><code>egrep</code> and <code>grep -E</code> - ERE</li>
<li><code>fgrep</code> and <code>grep -F</code> - string matching in parallel</li>
<li>POSIX standardizing brings them all into the single <code>grep</code> command</li>
</ul></li>
<li><code>sed</code> - text matching and substitution</li>
<li><code>awk</code> - pattern matching with programming</li>
<li>text editors: <code>ed</code>, <code>ex</code>, <code>vim</code>, <code>emacs</code></li>
<li>scripting languages, usually with their on flavours</li>
</ul>
</div>
<div id="outline-container-org97ea81b" class="outline-4">
<h4 id="org97ea81b"><code>grep</code> options</h4>
<div class="outline-text-4" id="text-org97ea81b">
<ul class="org-ul">
<li>use <code>pat</code> as pattern: <code>-e pat</code></li>
<li>read list of patterns from file: <code>-f file</code></li>
<li>ignore case in input: <code>-i</code></li>
<li>list matching input files: <code>-l</code></li>
<li>print lines that don't match: <code>-v</code></li>
<li>supress output ("quiet", exit status only): <code>-q</code>
<ul class="org-ul">
<li>often, you can use <code>&gt; /dev/null</code> instead (more obvious)</li>
</ul></li>
<li>don't print errors ("silent"): <code>-s</code></li>
</ul>
</div>
</div>
<div id="outline-container-org49195c0" class="outline-4">
<h4 id="org49195c0">Robustness</h4>
<div class="outline-text-4" id="text-org49195c0">
<ul class="org-ul">
<li>invest time in learning regexs</li>
<li>use EREs wherever possible</li>
<li><b>always quote your regexs on the shell command line</b></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2d3ade5" class="outline-3">
<h3 id="org2d3ade5">Basic regex components</h3>
<div class="outline-text-3" id="text-org2d3ade5">
<p>
Same as BREs:
</p>
<ul class="org-ul">
<li>matching single chars
<ul class="org-ul">
<li>reg chars, "dot", escaped metachars</li>
<li>bracket expressions: ranges and classes</li>
</ul></li>
<li>repetition with <code>*</code> and interval expression (<code>{...}</code>)</li>
<li>anchoring with <code>^</code> and <code>$</code></li>
<li>longest leftmost chars</li>
</ul>
</div>
</div>
<div id="outline-container-org6ec036a" class="outline-3">
<h3 id="org6ec036a">Aditional repetition operators</h3>
<div class="outline-text-3" id="text-org6ec036a">
<ul class="org-ul">
<li><code>re?</code> matches zero or one of <code>re</code> - "optional"</li>
<li><code>re+</code> matches one or more of <code>re</code> - "at least one of"</li>
</ul>

<p>
Note that <code>re</code> can be more than 1 char&#x2026;
</p>
<ul class="org-ul">
<li>applies to <code>*</code> and <code>{...}</code> also</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> ac abc abbc abbbc | grep -oE <span style="font-style: italic;">'ab?c'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'---'</span>
<span style="font-weight: bold;">echo</span> ac abc abbc abbbc | grep -oE <span style="font-style: italic;">'ab+c'</span>
</pre>
</div>

<pre class="example">
ac
abc
---
abc
abbc
abbbc
</pre>
</div>
</div>
<div id="outline-container-orgdbeee58" class="outline-3">
<h3 id="orgdbeee58">Grouping with parenthesis</h3>
<div class="outline-text-3" id="text-orgdbeee58">
<p>
Parentheses group smaller REs into larger ones.
</p>

<ul class="org-ul">
<li><code>([[:digit:]]{3}-[[:digit:]]{4}_)+</code> is one or more US phone numbers ("_" marks space for presentation purposes)</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> abc 555-1212 555-2121 cba | grep -oE <span style="font-style: italic;">'([[:digit:]]{3}-[[:digit:]]{4} )+'</span>
</pre>
</div>

<pre class="example">
555-1212 555-2121
</pre>


<ul class="org-ul">
<li><b>EREs do not have backreferences!</b></li>

<li>here too, things get cryptic quickly. Read from the <b>outside in</b></li>
</ul>
</div>
</div>
<div id="outline-container-org2850789" class="outline-3">
<h3 id="org2850789">Alternation</h3>
<div class="outline-text-3" id="text-org2850789">
<p>
Separate alternatives with <code>|</code>
</p>

<ul class="org-ul">
<li><code>(hello|hi)_world</code> matches <code>hello_world</code> and <code>hi_world</code></li>
<li>often used with parenthesis, as shown above</li>
<li>lowest precedence of all operators
<ul class="org-ul">
<li><code>^hello|hi$</code> -&gt; <code>(^hello)|(hi$)</code>, not <code>^(hello|hi)$</code></li>
</ul></li>
<li>makes EREs much more expressive than BREs</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'hi there
hello there'</span> | grep -oE <span style="font-style: italic;">'hello|hi'</span>
</pre>
</div>

<pre class="example">
hi
hello
</pre>


<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'hi there
hello there'</span> | grep -oE <span style="font-style: italic;">'^hello|hi$'</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'---'</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'hi there
hello there'</span> | grep -oE <span style="font-style: italic;">'^(hello|hi)$'</span>
</pre>
</div>

<pre class="example">
hello
---
</pre>
</div>
</div>
<div id="outline-container-org571ae13" class="outline-3">
<h3 id="org571ae13">ERE operator precedence</h3>
<div class="outline-text-3" id="text-org571ae13">
<ol class="org-ol">
<li>bracket symbols: <code>[:class:]</code>, <code>[=c=]</code>, <code>[.cs.]</code></li>
<li><code>\metacharacter</code></li>
<li>bracket expressions</li>
<li><code>(...)</code> grouping</li>
<li><code>*</code> <code>+</code> <code>?</code> and <code>{...}</code></li>
<li>concatenation</li>
<li><code>^</code> and <code>$</code> anchors</li>
<li>alternation</li>
</ol>
</div>
</div>
<div id="outline-container-org8c8335d" class="outline-3">
<h3 id="org8c8335d">Robustness</h3>
<div class="outline-text-3" id="text-org8c8335d">
<ul class="org-ul">
<li>always quote your REs
<ul class="org-ul">
<li>single quotes are much better than double</li>
</ul></li>
<li>with great power comes great responsability&#x2026;
<ul class="org-ul">
<li>pay more attention when using EREs</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfa1e954" class="outline-3">
<h3 id="orgfa1e954">Using plain grep</h3>
<div class="outline-text-3" id="text-orgfa1e954">
<p>
Without the <code>-E</code>
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> abc 555-1212 555-2121 cba | grep -o <span style="font-style: italic;">'\([[:digit:]]]\{3\}-[[:digit:]]\{4\} \)\+'</span>

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'hello
hi
howdy'</span> | grep -o <span style="font-style: italic;">'^\(hello\|hi\)$'</span>
</pre>
</div>

<pre class="example">
hello
hi
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
